Conf.Simple/src/InformationRegisters/SUI_СообщенияМобильныхУстройств/SUI_СообщенияМобильныхУстройств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_СообщенияМобильныхУстройств</name>
  <resources>
    <name>Сообщение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>МеткаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Отправитель</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_СообщенияМобильныхУстройств/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СформироватьДанныеЗаписи(Отправитель, Получатель) Экспорт
	
	Результат = Новый Структура();
	
	Результат.Вставить("Отправитель", Отправитель);
	Результат.Вставить("Получатель", Получатель);
	Результат.Вставить("МеткаВремени", ТекущаяУниверсальнаяДатаВМиллисекундах());
	Результат.Вставить("ДатаЗаписи", ТекущаяДатаСеанса());
	Результат.Вставить("ID", НРег(ОбщегоНазначения.КонтрольнаяСуммаСтрокой(
		SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.МассивЗначений(
			Отправитель, 
			Получатель, 
			Новый УникальныйИдентификатор(), 
			Результат.МеткаВремени
		), 
	ХешФункция.SHA1)));
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

Функция СоздатьСообщение(Отправитель, Получатель, Сообщение) Экспорт
	
	РезультатID = СформироватьДанныеЗаписи(Отправитель, Получатель);
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, РезультатID);
	МенеджерЗаписи.Сообщение = СокрЛП(Сообщение);
	
	МенеджерЗаписи.Записать(Истина);
	
	Возврат МенеджерЗаписи.ID;
	
КонецФункции

#КонецОбласти

#КонецЕсли
